cfd/OpenFOAM/compressible/rhoPimpleFoam/01_Laminar/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform $pressure;


boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
    }

    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
    }
    
    model
    {
        type            zeroGradient;
    }
    
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************* //
