cfd/OpenFOAM/compressible/rhoPimpleFoam/01_Laminar/system/include/relaxationFactors
// ************************************************************************* //
// Relaxation factors
// ************************************************************************* //

relaxationFactors_p         0.3;
relaxationFactors_U         0.5;
relaxationFactors_rho       0.01;
relaxationFactors_e         0.5;

// ************************************************************************* //
